var lng2date = require('./lng2date');

var sekki = [
  [ '小寒', '冬至より一陽起るが故に陰気に逆らう故益々冷る也' ],
  [ '大寒', '冷ゆることの至りて甚だしきときなれば也' ],
  [ '立春', '春の気たつを以て也' ],
  [ '雨水', '陽気地上に発し、雪氷とけて雨水となれば也' ],
  [ '啓蟄', '陽気地中にうごき、ちぢまる虫、穴をひらき出れば也' ],
  [ '春分', '日天の中を行て昼夜等分の時也' ],
  [ '清明', '万物発して清浄明潔なれば、此芽は何の草としれる也' ],
  [ '穀雨', '春雨降りて百穀を生化すれば也' ],
  [ '立夏', '夏の立つがゆへ也' ],
  [ '小満', '万物盈満すれば草木枝葉繁る' ],
  [ '芒種', '芒ある穀類、稼種する時也' ],
  [ '夏至', '陽熱至極しまた、日の長きのいたりなるを以て也' ],
  [ '小暑', '大暑来れる前なれば也' ],
  [ '大暑', '暑気いたりつまりたるゆえんなれば也' ],
  [ '立秋', '初めて秋の気立つがゆへなれば也' ],
  [ '処暑', '陽気とどまりて、初めて退きやまんとすれば也' ],
  [ '白露', '陰気ようやく重なりて露こごりて白色となれば也' ],
  [ '秋分', '陰陽の中分となれば也' ],
  [ '寒露', '陰寒の気に合って、露むすび凝らんとすれば也' ],
  [ '霜降', 'つゆが陰気に結ばれて、霜となりて降るゆへ也' ],
  [ '立冬', '冬の気立ち初めていよいよ冷ゆれば也' ],
  [ '小雪', '冷ゆるが故に雨も雪となりてくだるがゆへ也' ],
  [ '大雪', '雪いよいよ降り重ねる折からなれば也' ],
  [ '冬至', '日南の限りを行て日の短きの至りなれば也' ],
];

module.exports = function(date) {
  var year  = date.getFullYear();
  var month = date.getMonth();
  var day   = date.getDate();

  // 何番目の二十四節気が近いか
  var n = month * 2 + ( day < 14 ? 0 : 1 );
  // 最も近い二十四節気の日付を取得
  var near = lng2date( year, ( ( n + 19 ) * 15 ) % 360 );

  if ( day != near.getDate() ) {
    return null;
  }
  return sekki[n];
};
